{"config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00da\b<string>\u00da\b<lambda>\u00f5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "arguments": {}, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "nb_col": 5, "W_regularizer": null, "border_mode": "valid", "nb_filter": 24, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_1", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "nb_col": 5, "W_regularizer": null, "border_mode": "valid", "nb_filter": 36, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_2", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "nb_col": 5, "W_regularizer": null, "border_mode": "valid", "nb_filter": 48, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_3", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 1152, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 100, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 50, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "trainable": true, "W_regularizer": null, "input_dim": 10, "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}